import numpy as np



"""
Тестовые примеры для вариаций метода Гаусса.
"""


"""
Пример из задания:
"""

k = 14

C = np.array([[  0.2,   0.,    0.2,   0.,    0.  ],
              [  0.,    0.2,   0.,    0.2,   0.  ],
              [  0.2,   0.,    0.2,   0.,    0.2 ],
              [  0.,    0.2,   0.,    0.2,   0.  ],
              [  0.,    0.,    0.2,   0.,    0.2 ]])

D = np.array([[  2.33,   0.81,    0.67,    0.92,   -0.53 ],
              [ -0.53,   2.33,    0.81,    0.67,    0.92 ],
              [  0.92,  -0.53,    2.33,    0.81,    0.67 ],
              [  0.67,   0.92,   -0.53,    2.33,    0.81 ],
              [  0.81,   0.67,    0.92,   -0.53,    2.33 ]])

b = np.array([4.2, 4.2, 4.2, 4.2, 4.2])

A = k*C + D


"""
Тестовый пример 1 (простой пример):
"""

T1 = np.array([[ 5.,   -1.,   -1. ],
               [ 1.,    2.,    3. ],
               [ 4.,    3.,    2. ]])
v1 = np.array([0., 14., 16.])


"""
Тестовый пример 2 (другой простой пример):
"""

T2 = np.array([[ 2.,    3.,   -1. ],
               [ 1.,   -2.,    1. ],
               [ 1.,    0.,    2. ]])
v2 = np.array([9., 3., 2.])


"""
Тестовый пример 3 (случай, который не решит первая вариация из-за нуля в 0x0):
"""

T3 = np.array([[ 0.,    -3.9,   -1.6  ],
               [ 11.2,   50.,    15.8 ],
               [ 1.,     10.,    0.   ]])
v3 = np.array([0., 5., 22.2])


"""
Тестовый пример 4 (нерешаемый случай, то есть существует множество решений):
"""

T4 = np.array([[ 0.,   0.,   -0.   ],
               [ 2.,   9.4,   207. ],
               [ 1.,   10.,   372. ]])
v4 = np.array([0., -322.221, 22.2])


"""
Тестовый пример 5 (показать точность, достигаемую разными вариациями метода Гаусса):
"""

T5 = np.array([[  0.00000001,   0.,        -0.234       ],
               [  52.7,        -0.000777,   207.        ],
               [ -107.33,       101.99,     0.000000008 ]])
v5 = np.array([472., -3.2, 0.0271])

